/**
 * 集合：介绍如何使用标准库中的集合类
 * 
 * Java集合框架：介绍集合框架的基本设计以及使用方法。
 * 	将集合的接口与实现分离
 * 	Collection接口
 * 	迭代器
 * 	泛型实用方法
 * 	集合框架中的接口
 * 具体的集合
 * 	链表：减少列表中间插入或删除元素的代价。
 * 	数组列表：Avctor所有方法都是同步的，ArrayList方法不是同步的。
 * 	散列集：无序。
 * 	树集
 * 	队列与双端队列
 * 映射
 * 	基本映射操作
 * 	更新映射项
 * 	映射视图
 * 	弱散列映射：WeakHashMap
 * 	链接散列集与映射
 * 	枚举集与映射
 * 视图与包装器
 * 	轻量级集和包装器
 * 	子范围
 * 	不可修改的视图
 * 	同步视图
 * 	受查视图
 * 	关于可选操作的说明
 * 算法
 * 	排序与混排
 * 	二分查找
 * 	简单算法
 * 	批操作
 * 	集合与数组的转换
 * 	编写自己的算法
 * 遗留的集合
 * 	Hashtable类
 * 	枚举
 * 	属性映射
 * 	栈
 * 	位集：BitSet类用于存放一个位序列。
 * @author niuzhihuan
 */
package ch09;