package ch01;

/**
 * 本章简要介绍Java语言的发展历史
 * 本章知识点为观点信息。
 * @author niuzhihuan
 */
public class Java程序设计概述 {

	/**
	 * Java是一个完整的平台，有一个庞大的库，其提供了很多可重用的代码和一个诸如安全性、跨平台以及垃圾自动收集等服务的执行环境。
	 */
	public void Java程序设计平台() {
	}

	/**
	 * 简单性：语法类似C++，体积小
	 * 面向对象：重点在数据和对象接口上。
	 * 分布式：类库访问方便TCP/IP协议方便。
	 * 健壮性：Java编译器能检测出许多运行时的问题。
	 * 安全性：Java能防范各种攻击。
	 * 体系结构中立：编译器生成一种体系结构中立的目标文件格式，可以运行在任何Java运行时系统。
	 * 可移植性：基本数据类型大小以及有关运算都做了明确说明。
	 * 解释型
	 * 高性能：即时编译器。
	 * 多线程：多线程可以带来更好的交互响应和实时行为。
	 * 动态性：库中可以自由添加新方法和实例变量，而对客户端没有任何影响。
	 */
	public void Java白皮书的关键术语() {
	}

	/**
	 * 在网页中运行的Java程序称为applet
	 */
	public void Java_applet与Internet() {
	}

	/**
	 * 
	 */
	public void Java发展简史() {
	}

	public void 关于Java的常见误解() {
	}
}
